var data = [
 {
   "name": "Меридент (ООО \"Меридент\")",
   "address": "Каменоостровский,39||",
   "phone": "346-22-80 - клиника|8(921)902-30-51 - доктор|merident@mail.ru",
   "comment1": "б/н|242-80-20|",
   "comments": "просит ЧЕТКО следовать наряду, соблюдать рисунок на модели||"
 },
 {
   "name": "Пусто",
   "address": "Просвещения,21|Просвещения,54|Гражданский,114|",
   "phone": "597-05-05|595-05-05|290-88-88|8(921)578-90-15 - доктор",
   "comment1": "б/н|5794131@mail.ru|asstom@mail.ru|5977755@mail.ru",
   "comments": "отправляя работу, заполнить акты сверки на каждого пациента (фамилия, вид работы,№акта) |||"
 },
 {
   "name": "Киндзерская Оксана Алексеевна, частное лицо",
   "address": "| |Илюшина,1",
   "phone": "dr.ksen@mail.ru|8(921)779-77-59|info@33zub.ru",
   "comment1": "|нал.|(на Ильюшина)",
   "comments": "|363-09-33(офис)|"
 },
 {
   "name": "Еремеева Елена Юрьевна, частное лицо",
   "address": "Савушкина,143 (Эверест)||Большевиков,2 (Альманар) irol76@mail.ru||Некрасова, 14|",
   "phone": "635-66-60|964-97-17-доктор|588-28-00|589-11-84 альманар|Главный бухгалтер ООО \"Альманар+\"|Ирина Багрянова 940-57-42",
   "comment1": "нал.|||б/н||",
   "comments": "доктор наряды не пишет((, заказывает рет.капы, просит изготовить быстро (1-2дня), иногда присылает пац-та со слепками в клинику|||||"
 },
 {
   "name": "Студия Дент (ООО \"Студия Дент\")",
   "address": "Богатырский,57, к.1|",
   "phone": "342-37-83|8(911)751-64-63-Дарь.С.",
   "comment1": "б/н|",
   "comments": "доктор сама уточняет, откуда забрать работу и на кого делать док-ты|"
 },
 {
   "name": "Шемякина Дарья Сергеевна (частное лицо)",
   "address": "Энгельса,27 (Детский Евромед)|",
   "phone": "                |mail@studio-dent.ru",
   "comment1": "нал.|",
   "comments": "|"
 },
 {
   "name": "Эстетик Альянс (ООО \"Эстетик Альянс\")",
   "address": "|Парадная, 3, к.2|info@esteticalliance.ru|",
   "phone": "|244-03-05||",
   "comment1": "|б/н||",
   "comments": "|чаще всего рет.капы ||"
 },
 {
   "name": "Красивые зубы (ООО \"Красивые зубки\")",
   "address": "Достоевского,2|",
   "phone": "712-27-86|8(921)782-06-39 - доктор",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "Амистом (ООО \"Амистом\")",
   "address": "Энтузиастов,43, к.1",
   "phone": "577-73-33",
   "comment1": "б/н",
   "comments": "часто работа в 2 этапа: отливка моделей, потом - снятие прикуса. Бывает, что доктор вызывает в другие клиники."
 },
 {
   "name": "Клиника СМТ(ЗАО \"Поликлинический комплекс\")",
   "address": "Московский,22||",
   "phone": "8(921)385-32-51 - доктор|334-01-69|ivaneremin79@rambler.ru",
   "comment1": "||",
   "comments": "||"
 },
 {
   "name": "Золотое сечение (ООО \"Здоровье\")",
   "address": "Невский,154||",
   "phone": "717-87-56||",
   "comment1": "б/н||",
   "comments": "звонит всегда Жовтый Вячевслав Алексеевич - директор и администратор||"
 },
 {
   "name": "ЗАО \"Леге Артис\"",
   "address": "Софийская,д.17|",
   "phone": "706-14-14|",
   "comment1": "нал.|",
   "comments": "без документов! |"
 },
 {
   "name": "Смайл (ООО \"Смайл\")",
   "address": "Марата,29|Хасанская, 14,к.1|",
   "phone": "572-20-25|524-63-04|8(905)282-49-42 - доктор",
   "comment1": "б/н||",
   "comments": "доктор - ортопед, заказывает разные капы, надо уточнять - какие! ||"
 },
 {
   "name": "Мисс стоматология (ООО \"Мисс Стоматология\"",
   "address": "5-я Красноармейская,3|",
   "phone": "8(921)416-12-84 - доктор|400-05-77",
   "comment1": "б/н|",
   "comments": "a-storia.stomatologya@yandex.ru\n|"
 },
 {
   "name": "Профи Клиник (ООО \"ПРОФИ-КЛИНИК\")",
   "address": "Типанова, д.3|",
   "phone": "371-00-42 |proficlinic.spb@mail.ru",
   "comment1": "б/н|",
   "comments": "Краснова Н.А. часто работы привозит сама|"
 },
 {
   "name": "Парацельс Стома (ООО \"Парацельс Стома\")",
   "address": "Народная, 68, к.1|",
   "phone": "334-58-75|",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "ООО \"Белая Медведица\"",
   "address": "Большой пр.ВО, 56||",
   "phone": "305-00-14|mail@wbdent.ru|89602497793 Е.И.",
   "comment1": "б/н||",
   "comments": "8-921-562-24-53 Екатерина(ст.мс)|Смирнова|"
 },
 {
   "name": "Белозерская Марина Юрьевна (частное лицо)",
   "address": "||",
   "phone": "8(921)914-18-43 - доктор||",
   "comment1": "нал.||",
   "comments": "сама звонит и говорит, где забрать работу, или привозит сама||"
 },
 {
   "name": "Бурунбаева Альбина Ибрагимовна (частное лицо)",
   "address": "Гражданская ул., 16 (Евродент Профи)||",
   "phone": "8-981-710-20-20 - администратор Наталья||",
   "comment1": "нал.||",
   "comments": "прежде чем отвозить работу, созвониться с администратором - работают не кажд.день!||"
 },
 {
   "name": "Падалко Евгений Владимирович (частное лицо)",
   "address": "Наб.Мойки,31(Астра)|",
   "phone": "8(911)000-80-70|",
   "comment1": "нал.|",
   "comments": "иногда привозит работы на подразд-е и оплачивает там же|"
 },
 {
   "name": "ООО\" Эверест\"",
   "address": "Галерный проезд 5|izvo@mail.ru|941-95-95(доктор)",
   "phone": "355-96-05-клиника|8-911-917-69-29|",
   "comment1": "б/н||",
   "comments": "|Чихун ЕО 89219468313|"
 },
 {
   "name": "Доктор Дантист (ООО \"Юлия\")",
   "address": "пр.Сизова,21|clinic@u-stoma.ru",
   "phone": "(812)642-88-78|(812)431-34-73",
   "comment1": "б/н|нал.",
   "comments": "|"
 },
 {
   "name": "ОЛЕВ (ООО \"ОЛЕВ\")",
   "address": "ул.Наличная,51|",
   "phone": "350-34-33                                                                                           |vadim@olev.ru",
   "comment1": "|",
   "comments": "если меньше 5.000р.то нал.|"
 },
 {
   "name": "ДивиДент (ООО \"ДивиДент\")",
   "address": "Пр. Стачек д.92,к.3|dividentclinik@gmail.com|4-ая красноармейская д.19,2 этаж,12 кабинет Поликлиника №16|НИИ Вредена,Стом.отд,|ул.ак.Байкова,8",
   "phone": "677-18-60||8-931-303-31-20(доктор)||670-86-79",
   "comment1": "нал.||                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |нал|",
   "comments": "||||"
 },
 {
   "name": "Все Свои (ООО \"Дента-Эконом\")",
   "address": "Фермское шоссе,32||smolina@wilstream.ru",
   "phone": "||",
   "comment1": "||",
   "comments": "оплата проводится через Москву|высылаем счет для одобрения|"
 },
 {
   "name": "Мартиросян Сатеник Сержевна",
   "address": "sati_nv@mail.ru",
   "phone": "8-921-632-94-27(доктор)",
   "comment1": "нал.",
   "comments": ""
 },
 {
   "name": "\"ОНА\"(ООО \"Наука-Бизнес-Медицина \"ОНА\")",
   "address": "",
   "phone": "",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "Галицкая Анастасия Владимировна",
   "address": "",
   "phone": "",
   "comment1": "нал.",
   "comments": "заказывает через подразделение"
 },
 {
   "name": "Неля (ООО \"Неля\")",
   "address": "ул. Котина д.5||",
   "phone": "8-911-771-39-24(доктор)|miolsa@mail.ru (доктор)|747-02-04 клиника",
   "comment1": "нал.||",
   "comments": "||"
 },
 {
   "name": "Рами(АО \"Мед.центр РАМИ\")",
   "address": "ул.Гончарная д.20|",
   "phone": "(812)717-32-09- управляющая|717-65-79, 717-32-09.",
   "comment1": "б/н|",
   "comments": "Гурьева Наталья Александровна|"
 },
 {
   "name": "Реми(ООО \"Визит\")",
   "address": "Кузнецовская ул.11||",
   "phone": "369-90-23|8-953-150-11-95(доктор)|anna_lozyan@mail.ru",
   "comment1": "б/н||",
   "comments": "||"
 },
 {
   "name": "ПримаКС (ООО \"Клиника \"ПримаКС\")",
   "address": "пр. Старо-Петергофский, д.42||",
   "phone": "971-10-88|Ирина игоревна-управл.|info@prima-ks.ru",
   "comment1": "пока нал.???||",
   "comments": "910-44-43 Елена Валерьевна(бух)|work@prima-ks.ru|"
 },
 {
   "name": "Стоматология СЗМ",
   "address": "г. Гатчина ул.Коли-Подрядчикова д.22|Парашютная ул. 18/34 кв. 501",
   "phone": "987-78-78(доктор)                                 8-909-577-50-03 - админ.|8-901-371-52-25",
   "comment1": "б/н|нал.",
   "comments": "|забираем из дома"
 },
 {
   "name": "Лаврова Наталья Константиновна",
   "address": "",
   "phone": "",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"МСЧ №157\"",
   "address": "Варавская 100||",
   "phone": "415-37-01; 8-952-354-41-23|8-921-948-01-88 инна юрьевна менеджер|8-950-041-14-41 Дмитриева",
   "comment1": "б/н||",
   "comments": "|info@med157.ru|"
 },
 {
   "name": "ООО \"ДентЛайф\"",
   "address": "Старо-Петергофскийпр.,30||",
   "phone": "332-85-60;956-11-39|3328560@mail.ru|8-931-303-31-20(доктор)",
   "comment1": "б/н||",
   "comments": "в вых.не раб.||constantin-g@ya.ru"
 },
 {
   "name": "ООО \"Лета\"",
   "address": "Загородный пр, 21-23||",
   "phone": "315-02-22;572-48-48|8-921-750-08-08(Королева)|",
   "comment1": "б/н||",
   "comments": "||"
 },
 {
   "name": "Свежее Дыхание (ООО \"Санта\")",
   "address": "пр.Энгельса,133,к.1|",
   "phone": "8-921-639-60-53(доктор Александра)|517-61-23",
   "comment1": "|б/н",
   "comments": "|"
 },
 {
   "name": "ООО \"МЦ \"Новый Век\"",
   "address": "ул.Композиторов,12|||",
   "phone": "8-921-760-03-63-Управл.Виктория Виктор.|1vek2013@mail.ru|619-55-55|8-921-632-94-27(доктор)",
   "comment1": "|||б/н",
   "comments": "|||"
 },
 {
   "name": "Юнимед (ООО \"Виктория\")",
   "address": "Измайловский,9|",
   "phone": "251-59-05       600-10-06|unimedspb@gmail.com",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "УльтраМарин",
   "address": "Гаврская,15 (М.Удельная)|",
   "phone": "930-83-30; 995-33-95|9308330@mail.ru",
   "comment1": "нал|",
   "comments": "|"
 },
 {
   "name": "Дентал Сервис (ООО\"ДС\")",
   "address": "Дунайский пр.,55,к.1|",
   "phone": "242-17-00 , (962)684-68-66|2421607ds@mail.ru",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "ООО \"Куик Дентал\"",
   "address": "|пр.Космонавтов,д.61,к.1|",
   "phone": "382-86-39,929-60-90|8-921-355-13-13|quickdental@yandex.ru",
   "comment1": "|нал.|",
   "comments": "||"
 },
 {
   "name": "ООО \"ДК Дент\"",
   "address": "Ленинский пр.,132||",
   "phone": "372-06-90|dk.dent@mail.ru|8-911-931-36-86",
   "comment1": "нал.||Валер.Серг",
   "comments": "||"
 },
 {
   "name": "Альмеда (ООО\"Аллен\")",
   "address": "ул.Димитрова,д.8/2|",
   "phone": "366-07-92|admin@clinicalmeda.ru",
   "comment1": "б/н|",
   "comments": "Переживают о гарантии|"
 },
 {
   "name": "UNIDЕNT (ООО Сима плюс)",
   "address": "ул.Победы,д.16|",
   "phone": "388 52 73|Luku733@mail.ru",
   "comment1": "нал.|",
   "comments": "|600-77-92 офис"
 },
 {
   "name": "ООО \"Премьера\"",
   "address": "Петергофское ш. 53 лит.А,47Н||",
   "phone": "6076747|8-921-772-42-83 вероника(бухгалтер)|premiera812@mail.ru",
   "comment1": "б/н||",
   "comments": "||"
 },
 {
   "name": "ООО \"Виталь\"",
   "address": "Косыгина 17 к.1 лит.А, 2Н|",
   "phone": "331-64-64, 313-25-23|clinica@e-vital.ru",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "ООО \"Новая стоматология 2\"",
   "address": "Дачный пр.2 к.2||",
   "phone": "377-04-53|newstoma@mail.ru|",
   "comment1": "б/н||",
   "comments": "||"
 },
 {
   "name": "ООО \" Кинг Стом\"",
   "address": "Кингисепп, пр Карла Маркса,|14/13, пом.1Н|",
   "phone": "8-952-217-36-26|8-904-634-12-66 Яна Ген.|",
   "comment1": "пока нал.||",
   "comments": "||"
 },
 {
   "name": "ООО\"Медсанчасть НГК\"",
   "address": "|Красное село,Ленина 43к1||",
   "phone": "749-90-61 бухгалт.|8-921-091-99-92|8-904-516-09-21|749-90-61 Светл.Влад.директор",
   "comment1": "|б/н||",
   "comments": "|741-81-84 бух.||"
 },
 {
   "name": "ООО \"Голливуд смайл\"",
   "address": "Всеволода Вишневского 5||",
   "phone": "8-905-201-66-40 доктор|498-13-13 адм.|8-921-389-99-04",
   "comment1": "б/н||",
   "comments": "||"
 },
 {
   "name": "Поликлиника №1 РАН",
   "address": "|Университетская наб.5|",
   "phone": "kim_sofiya@mail.ru|328-41-12 пол-ка|8-911-130-11-59 доктор",
   "comment1": "|б/н|",
   "comments": "328-31-11 секретарь|info@spbmedran.ru|"
 },
 {
   "name": "ООО \"ЕИЗС\" \"Европ.Инст.Здоровья Семьи\"",
   "address": "Колпино,б.Трудящ.35к.1|Рубинштейна 25 лит.А|",
   "phone": "|8-921-782-00-18|",
   "comment1": "|б/н|",
   "comments": "info@rusdent.spb.ru|mail@eizs.ru|"
 },
 {
   "name": "ООО \"Диана дентал клиника\"",
   "address": "|Ветеранов 130||",
   "phone": "|572-83-02|diana_dental@mail.ru|8-960-267-81-62 Нино Фридоновна",
   "comment1": "|б/н||",
   "comments": "|||"
 },
 {
   "name": "ООО \"Новая стоматология\"",
   "address": "|ул.Конторская д.14|",
   "phone": "8-911-121-25-10|227-57-10|",
   "comment1": "|б/н|",
   "comments": "||"
 },
 {
   "name": "ООО \"Ренидент Премиум\"",
   "address": "|Оптиков 38 к.1|",
   "phone": "adm@renident.ru||717-65-79, 717-32-09.",
   "comment1": "|б/н|",
   "comments": "|adm@renident.ru|"
 },
 {
   "name": "ООО \"ДентИдеал Люкс\"",
   "address": "|Потемкинская 13\\48|Кирочная 48",
   "phone": "dentideal@gmail.com|273-02-90,457-31-43|8-952-361-42-06",
   "comment1": "|б/н|",
   "comments": "89216313435 Жаркова||2758370 бух."
 },
 {
   "name": "ООО \"Клиника по зубам\"",
   "address": "|Афанасьевская ул. д.1 лит А||",
   "phone": "384-63-33|971-79-72|ст. м/с Татьяна8(921)743-98-20|klinika_po_zubam@mail.ru",
   "comment1": "||б/н|",
   "comments": "|||"
 },
 {
   "name": "Буранбаева Альбина Ибрагимовна ",
   "address": "Мастерская ул. 11||",
   "phone": "8-911-833-25-48|713-88-13|",
   "comment1": "|нал|",
   "comments": "||"
 },
 {
   "name": "Бочарова Алена Олеговна",
   "address": "|Коломяжский 20 кв.699",
   "phone": "redlikes@inbox.ru|8-921-638-81-73",
   "comment1": "|нал.",
   "comments": "|"
 },
 {
   "name": "Скибская Надежда Владиславовна",
   "address": "ул. Черняховского 24 кв14",
   "phone": "8-904-613-55-85",
   "comment1": "нал",
   "comments": ""
 },
 {
   "name": "ООО \"Альфа-стом Плюс\"",
   "address": "Виленский пер.17/5",
   "phone": "579-20-90",
   "comment1": "нал",
   "comments": ""
 },
 {
   "name": "ООО \"Хеппи Дент\"",
   "address": "|Колпино, Онежская 1 |",
   "phone": "happy-dent@mail.ru|981-49-59|242-19-56",
   "comment1": "|б/н|",
   "comments": "||"
 },
 {
   "name": "ООО \"Клиника Мединеф\"",
   "address": "|Боткинская 15|",
   "phone": "|603-03-03|89219670462 директор",
   "comment1": "|б/н|",
   "comments": "6030303@medinef.ru|m250528@yandex.ru|"
 },
 {
   "name": "ООО \"Роял дентал клиник\" \"миллион яблок\"",
   "address": "Лыжный пер.3|",
   "phone": "313-55-45|",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "ООО \"МК-Дент+\"",
   "address": "|Пушкин,Центральная ул 21|",
   "phone": "452-55-55|mk@mk-dent.ru|8-981-752-50-50 Мария Владим.",
   "comment1": "|б/н|",
   "comments": "||"
 },
 {
   "name": "Кривуца Ксения Юрьевна",
   "address": "Пулковская 10-2-264",
   "phone": "8-921-393-40-11",
   "comment1": "нал",
   "comments": ""
 },
 {
   "name": "ООО \"Альтер Эго\"",
   "address": "|Ланское ш.3|",
   "phone": "496-59-91|8-963-346-09-53|",
   "comment1": "|нал|",
   "comments": "||"
 },
 {
   "name": "ООО \"Дентос\"",
   "address": "|Каменноостровский 20|",
   "phone": "235-77-55|293-07-80 центр.офис|",
   "comment1": "|нал|",
   "comments": "||"
 },
 {
   "name": "Васильева Екатерина Леонидовна",
   "address": "Марата 29 \"Смайл\"",
   "phone": "8-951-678-83-33",
   "comment1": "нал",
   "comments": "каппы жесткие,границы по шейкам!"
 },
 {
   "name": "ООО \"Мир стоматологии\"",
   "address": "5755270|Марата 47-49|",
   "phone": "2966466|8-965-797-48-89 Коган Э.М.|alstoma@mail.ru",
   "comment1": "|б/н|",
   "comments": "3242844 бух.доб.2174||marata_49@mail.ru"
 },
 {
   "name": "Петрикова Анастасия Николаевна",
   "address": "",
   "phone": "8-906-261-72-89",
   "comment1": "нал.",
   "comments": ""
 },
 {
   "name": "ООО \"Здоровье\"",
   "address": "|Бабушкина 3|",
   "phone": "nd-raz@yandex.ru|346-94-12|",
   "comment1": "|б/н|",
   "comments": "|412-20-20 техническая|"
 },
 {
   "name": "Цуркан Анна Валерьевна",
   "address": "",
   "phone": "8-905-258-56-14",
   "comment1": "нал.",
   "comments": ""
 },
 {
   "name": "Прокопенко Р.А.",
   "address": "",
   "phone": "8-904-616-45-40",
   "comment1": "нал.",
   "comments": ""
 },
 {
   "name": "ООО \"Айсберг+\"",
   "address": "Доблести 26 к1|||",
   "phone": "(812) 364-16-64|(931) 364-16-64|89626950488 Янковская|",
   "comment1": "б/н|||",
   "comments": "st.aisberg@mail.ru|446-00-01 Вероника Никол. Бух.|89992024288|ver.nik0909@gmail.com"
 },
 {
   "name": "Эрдман Ольга Валерьевна",
   "address": "",
   "phone": "8-921-091-42-24",
   "comment1": "",
   "comments": "olga.erdman@yandex.ru"
 },
 {
   "name": "ООО \"ЕМС\"",
   "address": "Победы 17|",
   "phone": "777-77-03|",
   "comment1": "|",
   "comments": "emc@EMCclinic.ru|89219559464 валент.петровна бух"
 },
 {
   "name": "ООО \"ИНТАН 10\"",
   "address": "|Вознесенский пр.21|",
   "phone": "|8-921-416-11-70 Дарья Игор.|315-50-20",
   "comment1": "|б/н|",
   "comments": "10@intan.ru|Чеснокова Надежда Петровна|8-921-9426613-управл."
 },
 {
   "name": "ООО \"ИНТАН 8\"",
   "address": "Российский 8|||",
   "phone": "|401-06-46||",
   "comment1": "б/н|||",
   "comments": "|||"
 },
 {
   "name": "ООО \"РАЙДЕН\" ООО \"АИВ\" ООО \"АЛЕВ\" РАЙДЕН ",
   "address": "Ленинский пр.116|||||",
   "phone": "|||||",
   "comment1": "б/н|||||",
   "comments": "info@raden.ru|||||"
 },
 {
   "name": "СМАЙЛ СИТИ",
   "address": "Лыжный пер.4||",
   "phone": "911-979-22-52; 662-14-92||",
   "comment1": "б/н||",
   "comments": "info@smilecity.spb.ru||"
 },
 {
   "name": "ООО \"Моя стоматология\"",
   "address": "Ильюшина 10|",
   "phone": "953-3571120|349-59-87",
   "comment1": "б/н|",
   "comments": "m-stoma-spb@yandex.ru|"
 },
 {
   "name": "ООО \"Юнидент-Санкт-Петербург\"",
   "address": "Ленинский 117 к 1 ",
   "phone": "753-94-53",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"Стоматология Михаила Есипович\"",
   "address": "Байконурская 15|",
   "phone": "406-17-10|+7 (921) 914-48-14",
   "comment1": "б/н|",
   "comments": "9144814@mail.ru|"
 },
 {
   "name": "ООО \"ЛИРА\"",
   "address": "Лесной пр.13/8|",
   "phone": "291-54-50|",
   "comment1": "|",
   "comments": "|"
 },
 {
   "name": "ООО \"Метелица-Дент\"",
   "address": "Пр.Обуховской обор.271|",
   "phone": "313-80-30|",
   "comment1": "|б/н",
   "comments": "info@metelitsa-dent.ru|9823709 Борис Борисович"
 },
 {
   "name": "Белозерская Марина Юрьевна",
   "address": "Новоизмайловский 65 дет.пол|",
   "phone": "|",
   "comment1": "нал|",
   "comments": "|"
 },
 {
   "name": "ООО \"Стоматология \"Седьмое небо\"",
   "address": "Петергофское шоссе 45",
   "phone": "600-17-88",
   "comment1": "б/н",
   "comments": "nebo6001788@yandex.ru"
 },
 {
   "name": "Каменская Екатерина Владимировна",
   "address": "",
   "phone": "8-962-704-54-98",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"Дк-дент Центр\"",
   "address": "Некрасова 58|",
   "phone": "717-71-80|",
   "comment1": "|",
   "comments": "dk-dent@mail.ru|"
 },
 {
   "name": "ООО \"Ортодонтическая клиника\"",
   "address": "Лесной 18",
   "phone": "541-85-12",
   "comment1": "б/н",
   "comments": "Матусевич Алена 89218600991"
 },
 {
   "name": "ООО \"МедГарант\"",
   "address": "Смоленская 9",
   "phone": "647-03-62",
   "comment1": "б/н",
   "comments": "info@medgarant-spb.ru"
 },
 {
   "name": "ООО \"БИЭМ-СПБ\"",
   "address": "Кораблестроителей 30||",
   "phone": "305-55-20|8-911-272-28-94 Игорь Валент.|89119225778 наташа бух.",
   "comment1": "б/н||",
   "comments": "martynov@bostoninst.ru|infospb@bostoninst.ru|ninatasha@yandex.ru"
 },
 {
   "name": "ООО \"ДОКТОРАРТ\"",
   "address": "Ленсовета 20|",
   "phone": "371-00-01|8-921-417-17-53",
   "comment1": "б/н|",
   "comments": "artac@yandex.ru|info@dentstudioart.ru"
 },
 {
   "name": "ООО \"АР-Мед\"",
   "address": "|Садовая 38",
   "phone": "310-01-26|983-33-33",
   "comment1": "|б/н",
   "comments": "|armedst@yandex.ru"
 },
 {
   "name": "ООО \"ЯКОБ\"",
   "address": "6 линия ВО д.37|",
   "phone": "323-53-41|8-951-647-75-26",
   "comment1": "|б/н",
   "comments": "|"
 },
 {
   "name": "ООО \"Валаам юг\"",
   "address": "Ветеранов 122|",
   "phone": "736-73-30|",
   "comment1": "б/н|",
   "comments": "valaam-med@mail.ru|"
 },
 {
   "name": "Шачнева Елена Геннадьевна",
   "address": "",
   "phone": "",
   "comment1": "нал",
   "comments": ""
 },
 {
   "name": "ООО \"Мастер-Дент\"",
   "address": "пр.Науки 17 к.2",
   "phone": "309-94-92",
   "comment1": "нал",
   "comments": "info@masterdent24.ru"
 },
 {
   "name": "ООО \"М-клиник\"",
   "address": "Приморский пр. 137к.1|с 10-20",
   "phone": "8-921-947-03-62|431-51-58",
   "comment1": "б/н|",
   "comments": "|"
 },
 {
   "name": "ООО \"Аллегро\"",
   "address": "Загородный 45",
   "phone": "3103425",
   "comment1": "",
   "comments": "allegro-stom@yandex.ru"
 },
 {
   "name": "ООО \"Конфиденция\"",
   "address": "Чайковского 5/10",
   "phone": "326-12-09",
   "comment1": "б/н",
   "comments": "smile@Konfidencia.ru"
 },
 {
   "name": "Косаревич Мария Геннадьевна",
   "address": "Ломоносов",
   "phone": "8-981-823-20-13",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"Ортодонтическая клиника\"",
   "address": "Лесной пр.18",
   "phone": "541-85-12",
   "comment1": "б/н",
   "comments": "dental_centre@mail.ru"
 },
 {
   "name": "ООО \"МедГарант\"",
   "address": "Смоленская 9",
   "phone": "647-03-62",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"ДокторАрт\"",
   "address": "|Ленсовета 20|",
   "phone": "8-921-417-17-53 Артак Степ.|371-00-01|",
   "comment1": "|б/н|",
   "comments": "|info@dentstudioart.ru|"
 },
 {
   "name": "ООО \"Ренидент Премиум\"",
   "address": "Оптиков 38",
   "phone": "385-87-85",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Санта\" Свежее Дыхание",
   "address": "Энгельса 133 к 1",
   "phone": "516-14-97",
   "comment1": "б/н",
   "comments": "reception@svezhee-dyhanie.ru"
 },
 {
   "name": "ООО \"Феникс\"",
   "address": "Колокольная 11 ",
   "phone": "710-80-65",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Идеальная пломба\"",
   "address": "Гражданский 117 к 1",
   "phone": "290-53-53",
   "comment1": "",
   "comments": "mail@ideal-plomba.ru"
 },
 {
   "name": "ООО \"Мед Лайн\"",
   "address": "Гжатская 5 к 3",
   "phone": "294-89-22",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"ЮНИДЕНТ-Сима М\"",
   "address": "Бухарестская 94 к 6",
   "phone": "600-77-92",
   "comment1": "нал",
   "comments": ""
 },
 {
   "name": "ООО \"Аллегро\"",
   "address": "Загородный 45",
   "phone": "310-34-25",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Оксисмайл\"",
   "address": "Пушкин, Железнодорожная 24",
   "phone": "466-54-74",
   "comment1": "б/н",
   "comments": "oksismile@mail.ru"
 },
 {
   "name": "ООО \"Эдванс\"  (\"зубки\")",
   "address": "Гагарина 14 к 6",
   "phone": "949-03-62",
   "comment1": "б/н",
   "comments": "zubkispb@rambler.ru"
 },
 {
   "name": "ООО \"Стоматологическая клиника\"Мир Здоровья\"",
   "address": "Колпино, Павловская 42",
   "phone": "961-48-85",
   "comment1": "б/н",
   "comments": "selina64@mail.ru"
 },
 {
   "name": "ООО \"Стомат. клиника \"Улыбка\"",
   "address": "Средний пр.ВО 88",
   "phone": "385-03-95",
   "comment1": "",
   "comments": "story_DS@mail.ru"
 },
 {
   "name": "ООО \"Форум Интернешнл Технолоджи\"",
   "address": "наб.Канала Грибоедова 99",
   "phone": "244-20-70",
   "comment1": "б/н",
   "comments": "forumint@m.astelit.ru"
 },
 {
   "name": "ООО \"Ренидент\"",
   "address": "Колпино,Анисимова 5 к 7",
   "phone": "467-51-49",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ЗАО \"Семейная стоматология\"",
   "address": "Выборг, наб.40 летия ВЛСКМ д7",
   "phone": "8-813-78-25-006",
   "comment1": "б/н",
   "comments": "stomatolog_vbg@mail.ru"
 },
 {
   "name": "ООО \"Зуб\"",
   "address": "Дмитровский 10",
   "phone": "8-921-945-16-35",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"СЦ \"Стомус\"",
   "address": "|Луначарского 49|",
   "phone": "|558-15-15|",
   "comment1": "|б/н|",
   "comments": "Кривец Наталья 438-16-72||"
 },
 {
   "name": "ООО \"Проф Смайл\"",
   "address": "11 красноармейская 11",
   "phone": "",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Изидент\" (Апельсин)",
   "address": "Туристская 18 к1 ",
   "phone": "",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"СП Мегаполис Дент\"",
   "address": "Московский 155",
   "phone": "368-22-55",
   "comment1": "б/н",
   "comments": "megapolisdent02@mail.ru"
 },
 {
   "name": "ООО \"Стаматолог. центр \"Авикул\"",
   "address": "Кондратьевский 64",
   "phone": "331-24-98",
   "comment1": "б/н",
   "comments": "centr-gatchina@mail.ru"
 },
 {
   "name": "ООО \"Дженерал Медикал Центр\"",
   "address": "Парадная 3 к2 ",
   "phone": "313-75-85",
   "comment1": "б/н",
   "comments": "info@gmc-spb.ru"
 },
 {
   "name": "ООО \"Дентал Комфорт\" ( Витаника)",
   "address": "Бабушкина 42",
   "phone": "",
   "comment1": "б/н",
   "comments": "ПЛАТЯТ ПЛОХО!"
 },
 {
   "name": "ООО \"Студия Дент\"",
   "address": "Богатырский 57 к 1",
   "phone": "342-37-83",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Эсте Центр\"",
   "address": "Инженерная 6",
   "phone": "8-999-042-19-03",
   "comment1": "б/н",
   "comments": "ПЛАТЯТ ПЛОХО!"
 },
 {
   "name": "ООО \"Айсберг\"",
   "address": "Октябрьская наб. 64 к 3",
   "phone": "",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Идеальный зуб Лахта\"",
   "address": "Савушкина 143 к 1",
   "phone": "",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ООО \"Ваш любимый стоматолог\"",
   "address": "Просвещения 30 к 1",
   "phone": "",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"Счастливые зубы\"",
   "address": "Ветеранов 122",
   "phone": "",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"МИП \"Институт стоматологии\"",
   "address": "Заневский 1/82",
   "phone": "",
   "comment1": "б/н",
   "comments": ""
 },
 {
   "name": "ИП Сычев АА",
   "address": "Петрозаводск, Калинина 57 В",
   "phone": "8-8142-57-24-19",
   "comment1": "б/н",
   "comments": "в счет включаем доставку!"
 },
 {
   "name": "ООО \"Чистое Дыхание\"",
   "address": "Малая Балканская  52|",
   "phone": "|",
   "comment1": "|",
   "comments": "vechelkovskaya@mail.ru|"
 },
 {
   "name": "ООО \"Стоматологический Центр Орхидея\"",
   "address": "Космонавтов 61 к1 ",
   "phone": "368-93-11",
   "comment1": "",
   "comments": "orhidea-stom@yandex.ru"
 },
 {
   "name": "ООО \"Нью ЛайнДент\"",
   "address": "Стахановцев 6/8",
   "phone": "",
   "comment1": "",
   "comments": ""
 },
 {
   "name": "ООО \"Прима-Стом\"",
   "address": "Звездная 11 к 1 ",
   "phone": "339-27-60; 8-965-066-66-20",
   "comment1": "",
   "comments": "prima_stom@mail.ru"
 },
 {
   "name": "ООО \"Эдельвейс\"  (Дент Клаб)",
   "address": "15-линия ВО 76",
   "phone": "602-17-17",
   "comment1": "б/н",
   "comments": "6021717@mail.ru"
 },
 {
   "name": "ООО \"Лентан\" (Артес)",
   "address": "Малый пр ВО 4",
   "phone": "",
   "comment1": "б/н",
   "comments": "arte-s@list.ru"
 },
 {
   "name": "ООО \"УСПЕШНЫЕ ЛЮДИ\"",
   "address": "г.Кировск, Набережная 1а",
   "phone": "",
   "comment1": "б/н",
   "comments": "le4imzubki@mail.ru"
 }
];

var _temp=[];
var _temp2=[];


_.each(data, function(e){ 
	e.organization = e.name;

	e.phone = e.phone.replace("|",", ");
	e.address = e.address.replace("|",", ")

	e.comments = e.comment1.replace("|",", ") + ", " + e.comments.replace("|",", ")
	//console.log(e)
	//e.set({'organization':e.get('name')})
	_temp.push(e);
})

_.each(_temp, function(e){ 
	e.organization = e.name;

	e.phone = e.phone.replace("|",", ");
	e.address = e.address.replace("|",", ")
	e.email = [];
	e.comments = e.comments.replace("|",", ");
	//console.log(e)
	//e.set({'organization':e.get('name')})
	delete e.comment1;

	var emails = e.phone.match(/(\S[^\s@]*@\S+)/gi)
  	if(emails){
	  	_.each(emails, function(mail){
	  		e.phone = e.phone.replace(mail, "");
	  	});

	  	e.email = [].concat(emails);
	  }

  	var emails = e.address.match(/(\S[^\s@]*@\S+)/gi)

  	if(emails){
	  	_.each(emails, function(mail){
	  		e.address = e.address.replace(mail, "");
	  	});
	  	e.email = [].concat(e.email,emails);
	}

  	var emails = e.comments.match(/(\S[^\s@]*@\S+)/gi)
  	if(emails){
	  	_.each(emails, function(mail){
	  		e.comments = e.comments.replace(mail, "");
	  	});
	  	e.email = [].concat(e.email,emails);
	}
	console.log(e.email);
	e.email = e.email.join(",");

  	e.phone = e.phone.replace("|",", ");
	e.address = e.address.replace("|",", ")
	e.comments = e.comments.replace("|",", ");
	e.email = e.email.replace("|",", ");

	e.client_address = e.address;

	delete e.address;

	_temp2.push(e);
})

console.log(_temp2)
//app.clients.add(_temp2);